DataProcessors/ВыгрузкаДанныхВSQL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаДанныхВSQL</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Date1C</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Department</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DepartmentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesNewOwn</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitNewOwn</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesNewSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitNewSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesOwnNewOnSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitOwnNewOnSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesUsedOwn</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitUsedOwn</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesUsedSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitUsedSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesUsedSepOwn</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitUsedSepOwn</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesUsedSepSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitUsedSepSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesOwnUsedSepBySide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitQwnUsedSepBySide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocAuthor</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PymtType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesOwnUsedOnSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProfitOwnUsedOnSide</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/ПланБюджетированияПоСтатьям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПланБюджетированияПоСтатьям</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VatNoVat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VatNoVat</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Стаття</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипПоказателяPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипПоказателяPL</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОперационнаяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибыльДоНалогооблажения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧистаяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PL_ОперационнаяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PL_ПрибыльДоНалогооблажения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PL_ЧистаяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PL_ЧистаяПрибыльСУчетомОптимизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PL_НДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВыгрузкаДанныхВSQL/Ext/ObjectModule.bsl
Перем АДОДБКоннект Экспорт;
Перем АДОДБКоманда Экспорт;
Перем АДОДБЗапись Экспорт;

Перем УзелОбменаСPowerBI Экспорт;

Перем ВыгружатьАДОДБ Экспорт;

/////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ВыгрузитьДанныеPowerBI() Экспорт
	
	Организации = Справочники.Организации.Выбрать();
	Пока Организации.Следующий() Цикл 
		ВыгрузитьНеоплаченныеЗаявки(Организации.Ссылка);
		
		
	КонецЦикла;
	АДОДБКоннект.Execute("USE [PowerBI_UPR] 
	|DROP TABLE UnpaidRequestsForExpenditureOfFunds
	| 
	| EXEC sp_rename 'UnpaidRequestsForExpenditureOfFunds_temp', 'UnpaidRequestsForExpenditureOfFunds'");
	
	АДОДБКоннект.Execute("USE [PowerBI_UPR]; EXEC sp_rename 'UnpaidRequestsForExpenditureOfFunds.ID_UnpaidRequestsForExpenditureOfFunds_temp', 'ID_UnpaidRequestsForExpenditureOfFunds', 'INDEX';");
	
	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьОрганизации(МассивСнятияРегистрации);
	СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьСчетаКассы(МассивСнятияРегистрации);
	СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьПодразделения(МассивСнятияРегистрации);
	СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьПроекты(МассивСнятияРегистрации);
	СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьСтатьиДДС(МассивСнятияРегистрации);
	СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьСтатьиPL(МассивСнятияРегистрации);
	СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьРазделыPL(МассивСнятияРегистрации);
	//СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации);
	
	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьПланПоБюджетуДДС(МассивСнятияРегистрации);
	//СнятьРегистрациюРегистра(Метаданные.РегистрыНакопления.ПланБюджетированияПоСтатьям,МассивСнятияРегистрации);

	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьПланПоБюджетуБДР(МассивСнятияРегистрации);
	//СнятьРегистрациюРегистра(Метаданные.РегистрыНакопления.ПланБюджетированияПоСтатьям,МассивСнятияРегистрации);
	МассивСнятияРегистрации = Новый Массив;
	ВыгрузитьФинРезультаты(МассивСнятияРегистрации);
	
	Организации = Справочники.Организации.Выбрать();
	
	Пока Организации.Следующий() Цикл 

		Если Организации.А_УправленческийУчет Тогда 
			ВыгрузитьОстаткиДДС(Организации.Ссылка);
			ВыгрузитьОборотыДДС(Организации.Ссылка);
			ВыгрузитьОборотыPL(Организации.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	АДОДБКоннект.Execute("USE [PowerBI_UPR] 
	|DROP TABLE CashBalance
	| 
	| EXEC sp_rename 'CashBalance_temp', 'CashBalance'");
	
	АДОДБКоннект.Execute("USE [PowerBI_UPR]; EXEC sp_rename 'CashBalance.PK_CashBalance_temp', 'PK_CashBalance', 'INDEX';");
	//---------------------------------------------------------------------------------------------------------------------------
	АДОДБКоннект.Execute("USE [PowerBI_UPR] 
	|DROP TABLE CashFlowTurnover
	| 
	| EXEC sp_rename 'CashFlowTurnover_temp', 'CashFlowTurnover'");
	
	АДОДБКоннект.Execute("USE [PowerBI_UPR]; EXEC sp_rename 'CashFlowTurnover.PK_CashFlowTurnover_temp', 'PK_CashFlowTurnover', 'INDEX';");
	//---------------------------------------------------------------------------------------------------------------------------

	АДОДБКоннект.Execute("USE [PowerBI_UPR] 
	|DROP TABLE PL
	| 
	| EXEC sp_rename 'PL_temp', 'PL'");
	
	АДОДБКоннект.Execute("USE [PowerBI_UPR]; EXEC sp_rename 'PL.PK_PL_temp', 'PK_PL', 'INDEX';");
	
	
	
КонецПроцедуры

Процедура ВыгрузитьОстаткиДДС(Организация)

	СхемаСКД = Обработки.ВыгрузкаДанныхВSQL.ПолучитьМакет("Макет");
	
	КомпоновщикНастроек = Неопределено;
	Если КомпоновщикНастроек = Неопределено Тогда
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);		
	КонецЕсли;
	
	Настройки         = КомпоновщикНастроек.ПолучитьНастройки(); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоГода(НачалоМесяца(ТекущаяДата())-90*24*60*60));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецДня(ТекущаяДата()));

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаСКД, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДанных.Использование = Истина;
	ПараметрДанных.Значение = НачалоГода(НачалоМесяца(ТекущаяДата())-365*24*60*60);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДанных.Использование = Истина;
	ПараметрДанных.Значение = КонецДня(ТекущаяДата());
	
	РезультатЗапроса = ПолучитьТаблицуЗначенийИзСКД(СхемаСКД,КомпоновщикНастроек);
	
	
	
	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("Day");
	МассивКлючевыхИмен.Добавить("IDOrganization");
	МассивКлючевыхИмен.Добавить("IDCashAccount");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "CashBalance_temp",МассивКлючевыхИмен , , );

	УстановитьАДОДБКоннект();

	
	
КонецПроцедуры

Процедура ВыгрузитьОборотыДДС(Организация)

	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""301""
	               |				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""302""
	               |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2
	               |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""311""
	               |				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""312""
	               |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1
	               |	КОНЕЦ КАК IDCashAccount,
	               |	ХозрасчетныйОстаткиИОбороты.Счет.Код КАК AccountingAccount,
	               |	ХозрасчетныйОстаткиИОбороты.Организация КАК IDOrganization,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборот КАК Amount,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто3 КАК IDDepartment,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""301""
	               |				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""302""
	               |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1
	               |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""311""
	               |				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""312""
	               |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2
	               |	КОНЕЦ КАК IDCashFlowStatement,
	               |	ХозрасчетныйОстаткиИОбороты.ПериодМесяц КАК Month,
	               |	ХозрасчетныйОстаткиИОбороты.ПериодДень КАК Day,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""301""
	               |				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""302""
	               |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто4
	               |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""311""
	               |				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""312""
	               |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто4
	               |	КОНЕЦ КАК IDProject
	               |ПОМЕСТИТЬ ПредИтоги
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Авто,
	               |			,
	               |			Счет.Код = ""301""
	               |				ИЛИ Счет.Код = ""311""
	               |				ИЛИ Счет.Код = ""302""
	               |				ИЛИ Счет.Код = ""312"",
	               |			,
	               |			Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредИтоги.IDCashAccount,
	               |	ПредИтоги.AccountingAccount,
	               |	ПредИтоги.IDOrganization,
	               |	ПредИтоги.Amount,
	               |	ПредИтоги.IDDepartment,
	               |	ПредИтоги.IDCashFlowStatement,
	               |	ПредИтоги.Month,
	               |	ПредИтоги.Day,
	               |	ПредИтоги.IDProject
	               |ИЗ
	               |	ПредИтоги КАК ПредИтоги";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(НачалоМесяца(ТекущаяДата())-365*24*60*60));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));

	Запрос.УстановитьПараметр("Организация",Организация);


	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("Month");
	МассивКлючевыхИмен.Добавить("Day");
	МассивКлючевыхИмен.Добавить("IDOrganization");
	МассивКлючевыхИмен.Добавить("IDCashAccount");
	МассивКлючевыхИмен.Добавить("IDDepartment");
	МассивКлючевыхИмен.Добавить("IDCashFlowStatement");
	МассивКлючевыхИмен.Добавить("IDProject");

	
	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "CashFlowTurnover_temp",МассивКлючевыхИмен , , );
	
КонецПроцедуры

Процедура ВыгрузитьСчетаКассы(МассивСнятияРегистрации)

	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ОбособленныеПодразделенияОрганизацийИзменения.Ссылка.Ссылка КАК IDCashAccount,
	              |	ОбособленныеПодразделенияОрганизацийИзменения.Ссылка.Владелец КАК IDOrganization,
	              |	ОбособленныеПодразделенияОрганизацийИзменения.Ссылка.Наименование КАК Name,
	              |	Кассы.ВалютаДенежныхСредств.Наименование КАК CashCurrency,
	              |	""Cash"" КАК CashAccountType,
	              |	ОбособленныеПодразделенияОрганизацийИзменения.Ссылка КАК СнятиеРегистрации
	              |ИЗ
	              |	Справочник.ОбособленныеПодразделенияОрганизаций.Изменения КАК ОбособленныеПодразделенияОрганизацийИзменения
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	              |		ПО ОбособленныеПодразделенияОрганизацийИзменения.Ссылка = Кассы.ОбособленноеПодразделение
	              |ГДЕ
	              |	ОбособленныеПодразделенияОрганизацийИзменения.Узел = &Узел
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	БанковскиеСчетаИзменения.Ссылка,
	              |	БанковскиеСчетаИзменения.Ссылка.Владелец,
	              |	БанковскиеСчетаИзменения.Ссылка.Наименование,
	              |	БанковскиеСчетаИзменения.Ссылка.ВалютаДенежныхСредств,
	              |	""Non-cash"",
	              |	БанковскиеСчетаИзменения.Ссылка
	              |ИЗ
	              |	Справочник.БанковскиеСчета.Изменения КАК БанковскиеСчетаИзменения
	              |ГДЕ
	              |	БанковскиеСчетаИзменения.Узел = &Узел";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDCashAccount");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "CashAccounts", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьОрганизации(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ОрганизацииИзменения.Ссылка.Ссылка КАК IDOrganization,
	              |	ОрганизацииИзменения.Ссылка.Наименование КАК Name,
	              |	ОрганизацииИзменения.Ссылка КАК СнятиеРегистрации
	              |ИЗ
	              |	Справочник.Организации.Изменения КАК ОрганизацииИзменения
	              |ГДЕ
	              |	ОрганизацииИзменения.Узел = &Узел";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDOrganization");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "Organizations", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьПодразделения(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ПодразделенияИзменения.Ссылка.Ссылка КАК IDDepartment,
	              |	ПодразделенияИзменения.Ссылка.Наименование КАК Name,
	              |	ПодразделенияИзменения.Ссылка.Ссылка КАК СнятиеРегистрации,
	              |	ВЫБОР
	              |		КОГДА ПодразделенияИзменения.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	              |			ТОГДА ПодразделенияИзменения.Ссылка.Представление
	              |		КОГДА ПодразделенияИзменения.Ссылка.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	              |			ТОГДА ПодразделенияИзменения.Ссылка.Родитель.Представление
	              |		КОГДА ПодразделенияИзменения.Ссылка.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	              |			ТОГДА ПодразделенияИзменения.Ссылка.Родитель.Родитель.Представление
	              |		КОГДА ПодразделенияИзменения.Ссылка.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	              |			ТОГДА ПодразделенияИзменения.Ссылка.Родитель.Родитель.Родитель.Представление
	              |	КОНЕЦ КАК Parent
	              |ИЗ
	              |	Справочник.Подразделения.Изменения КАК ПодразделенияИзменения
	              |ГДЕ
	              |	ПодразделенияИзменения.Узел = &Узел
	              |	И НЕ ПодразделенияИзменения.Ссылка.ПометкаУдаления";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDDepartment");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "Departments", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьПроекты(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ПроектыИзменения.Ссылка.Ссылка КАК IDProject,
	              |	ПроектыИзменения.Ссылка.Наименование КАК Name,
	              |	ПроектыИзменения.Ссылка.Ссылка КАК СнятиеРегистрации
	              |ИЗ
	              |	Справочник.Проекты.Изменения КАК ПроектыИзменения
	              |ГДЕ
	              |	ПроектыИзменения.Узел = &Узел
	              |	И НЕ ПроектыИзменения.Ссылка.ПометкаУдаления";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDProject");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "Projects", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьФинРезультаты(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ОпределениеФинансовыхРезультатов.Организация КАК IDOrganization,
	              |	МАКСИМУМ(ОпределениеФинансовыхРезультатов.Дата) КАК Дата
	              |ПОМЕСТИТЬ ПредИтоги
	              |ИЗ
	              |	Документ.ОпределениеФинансовыхРезультатов КАК ОпределениеФинансовыхРезультатов
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ОпределениеФинансовыхРезультатов.Организация
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	МЕСЯЦ(ПредИтоги.Дата) КАК Month,
	              |	ДЕНЬ(ПредИтоги.Дата) КАК Day,
	              |	ПредИтоги.IDOrganization,
	              |	ГОД(ПредИтоги.Дата) КАК Year
	              |ИЗ
	              |	ПредИтоги КАК ПредИтоги";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDOrganization");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "ClosedPeriods", МассивКлючевыхИмен,);

КонецПроцедуры


Процедура ВыгрузитьСтатьиДДС(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	СтатьиДвиженияДенежныхСредствИзменения.Ссылка.Ссылка КАК IDCashFlowStatement,
	              |	СтатьиДвиженияДенежныхСредствИзменения.Ссылка.Наименование КАК Name,
	              |	СтатьиДвиженияДенежныхСредствИзменения.Ссылка.Ссылка КАК СнятиеРегистрации
	              |ИЗ
	              |	Справочник.СтатьиДвиженияДенежныхСредств.Изменения КАК СтатьиДвиженияДенежныхСредствИзменения
	              |ГДЕ
	              |	СтатьиДвиженияДенежныхСредствИзменения.Узел = &Узел
	              |	И НЕ СтатьиДвиженияДенежныхСредствИзменения.Ссылка.ЭтоГруппа
	              |	И НЕ СтатьиДвиженияДенежныхСредствИзменения.Ссылка.ПометкаУдаления";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDCashFlowStatement");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "CashFlowStatements", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьРазделыPL(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	РазделыPL.Ссылка.Ссылка КАК IDDivisionPL,
	              |	РазделыPL.Ссылка.Наименование КАК Name,
	              |	РазделыPL.Ссылка.Ссылка КАК СнятиеРегистрации,
	              |	РазделыPL.Сортировка КАК Sort
	              |ИЗ
	              |	Справочник.РазделыPL КАК РазделыPL
	              |ГДЕ
	              |	НЕ РазделыPL.Ссылка.ЭтоГруппа";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDDivisionPL");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "PLDivisions", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры


Процедура ВыгрузитьСтатьиPL(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	СтатьиДоходовИзменения.Ссылка.Ссылка КАК IDPLStatement,
	              |	СтатьиДоходовИзменения.Ссылка.Наименование КАК Name,
	              |	СтатьиДоходовИзменения.Ссылка.Ссылка КАК СнятиеРегистрации,
	              |	СтатьиДоходовИзменения.Ссылка.РазделPL КАК PLDivision,
	              |	""Profit"" КАК PL
	              |ИЗ
	              |	Справочник.СтатьиДоходов.Изменения КАК СтатьиДоходовИзменения
	              |ГДЕ
	              |	СтатьиДоходовИзменения.Узел = &Узел
	              |	И НЕ СтатьиДоходовИзменения.Ссылка.ЭтоГруппа
	              |	И НЕ СтатьиДоходовИзменения.Ссылка.ПометкаУдаления
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	СтатьиЗатратИзменения.Ссылка.Ссылка,
	              |	СтатьиЗатратИзменения.Ссылка.Наименование,
	              |	СтатьиЗатратИзменения.Ссылка.Ссылка,
	              |	СтатьиЗатратИзменения.Ссылка.РазделPL,
	              |	""Loss""
	              |ИЗ
	              |	Справочник.СтатьиЗатрат.Изменения КАК СтатьиЗатратИзменения
	              |ГДЕ
	              |	СтатьиЗатратИзменения.Узел = &Узел
	              |	И НЕ СтатьиЗатратИзменения.Ссылка.ЭтоГруппа
	              |	И НЕ СтатьиЗатратИзменения.Ссылка.ПометкаУдаления";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDPLStatement");

	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "PLStatements", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры


Процедура ВыгрузитьПланПоБюджетуДДС(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ПланБюджетированияПоСтатьямИзменения.Регистратор КАК IDDocument,
	              |	ПланБюджетированияПоСтатьямОбороты.ПериодМесяц КАК Month,
	              |	ПланБюджетированияПоСтатьямОбороты.Организация КАК IDOrganization,
	              |	ПланБюджетированияПоСтатьямОбороты.Подразделение КАК IDDepartment,
	              |	ПланБюджетированияПоСтатьямОбороты.Статья КАК IDStatement,
	              |	ПланБюджетированияПоСтатьямОбороты.Проект КАК IDProject,
	              |	ПланБюджетированияПоСтатьямОбороты.СуммаОборот КАК Amount,
	              |	ПланБюджетированияПоСтатьямИзменения.Регистратор КАК СнятиеРегистрации,
	              |	ВЫБОР
	              |		КОГДА ПланБюджетированияПоСтатьямОбороты.Статья ССЫЛКА Справочник.СтатьиДвиженияДенежныхСредств
	              |			ТОГДА ""CashFlow""
	              |		ИНАЧЕ ""IncomeExpense""
	              |	КОНЕЦ КАК BudgetItemType,
	              |	ПланБюджетированияПоСтатьямОбороты.ПериодДень КАК Day
	              |ИЗ
	              |	РегистрНакопления.ПланБюджетированияПоСтатьям.Изменения КАК ПланБюджетированияПоСтатьямИзменения
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланБюджетированияПоСтатьям.Обороты(, , Авто, ) КАК ПланБюджетированияПоСтатьямОбороты
	              |		ПО ПланБюджетированияПоСтатьямИзменения.Регистратор = ПланБюджетированияПоСтатьямОбороты.Регистратор
	              |ГДЕ
	              |	ВЫБОР
	              |			КОГДА ПланБюджетированияПоСтатьямОбороты.Статья ССЫЛКА Справочник.СтатьиДвиженияДенежныхСредств
	              |				ТОГДА ИСТИНА
	              |			ИНАЧЕ ЛОЖЬ
	              |		КОНЕЦ";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDDocument");
	МассивКлючевыхИмен.Добавить("Month");
	МассивКлючевыхИмен.Добавить("IDOrganization");
	МассивКлючевыхИмен.Добавить("IDDepartment");
	МассивКлючевыхИмен.Добавить("IDStatement");
	МассивКлючевыхИмен.Добавить("IDProject");
	Для Каждого Строка из РезультатЗапроса Цикл 
		СтруктураОтбора = новый структура;
		СтруктураОтбора.Вставить("Регистратор",Строка.IDDocument);
		МассивСнятияРегистрации.Добавить(СтруктураОтбора);
	КонецЦикла;
	
	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "PlansCashFlow", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьПланПоБюджетуБДР(МассивСнятияРегистрации)

	
	Запрос = Новый Запрос();

	Запрос.Текст ="ВЫБРАТЬ
	              |	ПланБюджетированияПоСтатьямИзменения.Регистратор КАК IDDocument,
	              |	ПланБюджетированияПоСтатьямОбороты.ПериодМесяц КАК Month,
	              |	ПланБюджетированияПоСтатьямОбороты.Организация КАК IDOrganization,
	              |	ПланБюджетированияПоСтатьямОбороты.Подразделение КАК IDDepartment,
	              |	ПланБюджетированияПоСтатьямОбороты.Статья КАК IDStatement,
	              |	ПланБюджетированияПоСтатьямОбороты.Проект КАК IDProject,
	              |	ПланБюджетированияПоСтатьямОбороты.СуммаОборот КАК Amount,
	              |	ПланБюджетированияПоСтатьямИзменения.Регистратор КАК СнятиеРегистрации,
	              |	ВЫБОР
	              |		КОГДА ПланБюджетированияПоСтатьямОбороты.Статья ССЫЛКА Справочник.СтатьиДвиженияДенежныхСредств
	              |			ТОГДА ""CashFlow""
	              |		ИНАЧЕ ""IncomeExpense""
	              |	КОНЕЦ КАК BudgetItemType,
	              |	ПланБюджетированияПоСтатьямОбороты.ПериодДень КАК Day
	              |ИЗ
	              |	РегистрНакопления.ПланБюджетированияПоСтатьям.Изменения КАК ПланБюджетированияПоСтатьямИзменения
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланБюджетированияПоСтатьям.Обороты(, , Авто, ) КАК ПланБюджетированияПоСтатьямОбороты
	              |		ПО ПланБюджетированияПоСтатьямИзменения.Регистратор = ПланБюджетированияПоСтатьямОбороты.Регистратор
	              |ГДЕ
	              |	ВЫБОР
	              |			КОГДА ПланБюджетированияПоСтатьямОбороты.Статья ССЫЛКА Справочник.СтатьиДвиженияДенежныхСредств
	              |				ТОГДА ЛОЖЬ
	              |			ИНАЧЕ ИСТИНА
	              |		КОНЕЦ";

	Запрос.УстановитьПараметр("Узел", УзелОбменаСPowerBI);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDDocument");
	МассивКлючевыхИмен.Добавить("Month");
	МассивКлючевыхИмен.Добавить("IDOrganization");
	МассивКлючевыхИмен.Добавить("IDDepartment");
	МассивКлючевыхИмен.Добавить("IDStatement");
	МассивКлючевыхИмен.Добавить("IDProject");
	Для Каждого Строка из РезультатЗапроса Цикл 
		СтруктураОтбора = новый структура;
		СтруктураОтбора.Вставить("Регистратор",Строка.IDDocument);
		МассивСнятияРегистрации.Добавить(СтруктураОтбора);
	КонецЦикла;
	
	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "PlansPL", МассивКлючевыхИмен, ,МассивСнятияРегистрации);

КонецПроцедуры

Процедура ВыгрузитьОборотыPL(Организация)

	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""702""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""703""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""704""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""709""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""7091""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""7092""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""719""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""712""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""732""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""94""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""93""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""940""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""941""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""942""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""944""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""945""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""946""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""947""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""948""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""949""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто1
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""92""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""91""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""901""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""902""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""903""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""943""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""976""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто2
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""952""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""951""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""981""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто3
	               |	КОНЕЦ КАК Статья,
	               |	-1 * ХозрасчетныйОбороты.СуммаОборот КАК Сумма,
	               |	ХозрасчетныйОбороты.ПериодМесяц КАК Month,
	               |	ХозрасчетныйОбороты.Счет,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""702""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""703""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""704""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""709""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""7091""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""7092""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""712""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""943""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""976""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто3
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""719""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""732""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""94""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""93""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""940""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""941""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""942""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""944""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""945""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""946""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""947""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""948""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""949""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""952""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""951""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""981""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто2
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""92""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""91""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""901""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""902""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""903""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто3
	               |	КОНЕЦ КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""702""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""703""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""704""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""709""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""7091""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""7092""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто4
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""719""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""732""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""945""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""947""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""948""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""93""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто3
	               |		КОГДА ХозрасчетныйОбороты.Счет.Код = ""92""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""91""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""901""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""902""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""903""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""952""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""951""
	               |				ИЛИ ХозрасчетныйОбороты.Счет.Код = ""981""
	               |			ТОГДА ХозрасчетныйОбороты.Субконто4
	               |	КОНЕЦ КАК Проект,
	               |	ХозрасчетныйОбороты.Организация
	               |ПОМЕСТИТЬ ДанныеПоОборотам
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Авто,
	               |			Счет.Код = ""902""
	               |				ИЛИ Счет.Код = ""903""
	               |				ИЛИ Счет.Код = ""92""
	               |				ИЛИ Счет.Код = ""93""
	               |				ИЛИ Счет.Код = ""902""
	               |				ИЛИ Счет.Код = ""702""
	               |				ИЛИ Счет.Код = ""703""
	               |				ИЛИ Счет.Код = ""7092""
	               |				ИЛИ Счет.Код = ""704""
	               |				ИЛИ Счет.Код = ""709""
	               |				ИЛИ Счет.Код = ""7091""
	               |				ИЛИ Счет.Код = ""719""
	               |				ИЛИ Счет.Код = ""712""
	               |				ИЛИ Счет.Код = ""732""
	               |				ИЛИ Счет.Код = ""94""
	               |				ИЛИ Счет.Код = ""940""
	               |				ИЛИ Счет.Код = ""941""
	               |				ИЛИ Счет.Код = ""942""
	               |				ИЛИ Счет.Код = ""943""
	               |				ИЛИ Счет.Код = ""944""
	               |				ИЛИ Счет.Код = ""945""
	               |				ИЛИ Счет.Код = ""946""
	               |				ИЛИ Счет.Код = ""947""
	               |				ИЛИ Счет.Код = ""948""
	               |				ИЛИ Счет.Код = ""949""
	               |				ИЛИ Счет.Код = ""91""
	               |				ИЛИ Счет.Код = ""952""
	               |				ИЛИ Счет.Код = ""951""
	               |				ИЛИ Счет.Код = ""976""
	               |				ИЛИ Счет.Код = ""981"",
	               |			,
	               |			Организация = &Организация,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |ГДЕ
	               |	НЕ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ОпределениеФинансовыхРезультатов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РазделыPL.Ссылка КАК Раздел,
	               |	ДанныеПоОборотам.Статья,
	               |	ДанныеПоОборотам.Сумма,
	               |	ДанныеПоОборотам.Счет,
	               |	ДанныеПоОборотам.Подразделение,
	               |	ДанныеПоОборотам.Проект,
	               |	ДанныеПоОборотам.Организация,
	               |	ДанныеПоОборотам.Month
	               |ПОМЕСТИТЬ ПредИтог
	               |ИЗ
	               |	Справочник.РазделыPL КАК РазделыPL
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоОборотам КАК ДанныеПоОборотам
	               |		ПО РазделыPL.Ссылка = ДанныеПоОборотам.Статья.РазделPL
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&EBIDA,
	               |	NULL,
	               |	ДанныеПоОборотам.Сумма,
	               |	NULL,
	               |	ДанныеПоОборотам.Подразделение,
	               |	ДанныеПоОборотам.Проект,
	               |	ДанныеПоОборотам.Организация,
	               |	ДанныеПоОборотам.Month
	               |ИЗ
	               |	ДанныеПоОборотам КАК ДанныеПоОборотам
	               |ГДЕ
	               |	ДанныеПоОборотам.Статья.РазделPL.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипПоказателяPL.ОперационнаяПрибыль)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&ПрибыльДоНалогооблажения,
	               |	NULL,
	               |	ДанныеПоОборотам.Сумма,
	               |	NULL,
	               |	ДанныеПоОборотам.Подразделение,
	               |	ДанныеПоОборотам.Проект,
	               |	ДанныеПоОборотам.Организация,
	               |	ДанныеПоОборотам.Month
	               |ИЗ
	               |	ДанныеПоОборотам КАК ДанныеПоОборотам
	               |ГДЕ
	               |	(ДанныеПоОборотам.Статья.РазделPL.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипПоказателяPL.ОперационнаяПрибыль)
	               |			ИЛИ ДанныеПоОборотам.Статья.РазделPL.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипПоказателяPL.ПрибыльДоНалогооблажения))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&ЧистяПрибыль,
	               |	NULL,
	               |	ДанныеПоОборотам.Сумма,
	               |	NULL,
	               |	ДанныеПоОборотам.Подразделение,
	               |	ДанныеПоОборотам.Проект,
	               |	ДанныеПоОборотам.Организация,
	               |	ДанныеПоОборотам.Month
	               |ИЗ
	               |	ДанныеПоОборотам КАК ДанныеПоОборотам
	               |ГДЕ
	               |	ДанныеПоОборотам.Статья.РазделPL.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипПоказателяPL.PL_НДС)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&ЧистяПрибыльПослеОптимизации,
	               |	NULL,
	               |	ДанныеПоОборотам.Сумма,
	               |	NULL,
	               |	ДанныеПоОборотам.Подразделение,
	               |	ДанныеПоОборотам.Проект,
	               |	ДанныеПоОборотам.Организация,
	               |	ДанныеПоОборотам.Month
	               |ИЗ
	               |	ДанныеПоОборотам КАК ДанныеПоОборотам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредИтог.Раздел КАК IDDivision,
	               |	ПредИтог.Статья КАК IDPLStatement,
	               |	СУММА(ВЫРАЗИТЬ(ПредИтог.Сумма КАК ЧИСЛО(10, 2))) КАК Ammount,
	               |	ПредИтог.Счет КАК AccountingAccount,
	               |	ПредИтог.Подразделение КАК IDDepartment,
	               |	ПредИтог.Проект КАК IDProject,
	               |	СУММА(ПредИтог.Раздел.Сортировка) КАК Sort,
	               |	ПредИтог.Организация КАК IDOrganization,
	               |	ПредИтог.Month
	               |ИЗ
	               |	ПредИтог КАК ПредИтог
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредИтог.Раздел,
	               |	ПредИтог.Статья,
	               |	ПредИтог.Счет,
	               |	ПредИтог.Подразделение,
	               |	ПредИтог.Организация,
	               |	ПредИтог.Проект,
	               |	ПредИтог.Month
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Sort";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(НачалоМесяца(ТекущаяДата())-700*24*60*60));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("EBIDA", Справочники.РазделыPL.НайтиПоРеквизиту("ТипПоказателя",Перечисления.ТипПоказателяPL.PL_ОперационнаяПрибыль));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ПрибыльДоНалогооблажения",Справочники.РазделыPL.НайтиПоРеквизиту("ТипПоказателя",Перечисления.ТипПоказателяPL.PL_ПрибыльДоНалогооблажения));
	Запрос.УстановитьПараметр("ЧистяПрибыль",Справочники.РазделыPL.НайтиПоРеквизиту("ТипПоказателя",Перечисления.ТипПоказателяPL.PL_ЧистаяПрибыль));
	Запрос.УстановитьПараметр("ЧистяПрибыльПослеОптимизации",Справочники.РазделыPL.НайтиПоРеквизиту("ТипПоказателя",Перечисления.ТипПоказателяPL.PL_ЧистаяПрибыльСУчетомОптимизации));


	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("Month");
	МассивКлючевыхИмен.Добавить("IDOrganization");
	МассивКлючевыхИмен.Добавить("IDDepartment");
	МассивКлючевыхИмен.Добавить("IDPLStatement");
	МассивКлючевыхИмен.Добавить("IDProject");
	МассивКлючевыхИмен.Добавить("AccountingAccount");


	
	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "PL_temp",МассивКлючевыхИмен , , );
	
КонецПроцедуры

Процедура ВыгрузитьНеоплаченныеЗаявки(Организация)

	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК Amount,
	               |	ЗаявкиНаРасходованиеСредствОстатки.Контрагент.Наименование КАК Contractor,
	               |	ЗаявкиНаРасходованиеСредствОстатки.Организация КАК IDOrganization,
	               |	ЗаявкиНаРасходованиеСредствОстатки.Проект КАК IDProject,
	               |	ЗаявкиНаРасходованиеСредствОстатки.СтатьяДвиженияДенежныхСредств КАК IDCashFlowStatement,
	               |	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.ЦФО КАК IDDepartment,
	               |	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование КАК IDRequestsForExpenditureOfFunds,
	               |	НАЧАЛОПЕРИОДА(ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Дата, ДЕНЬ) КАК Day,
	               |	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Статус) КАК Status
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(
	               |			,
	               |			ЗаявкаНаРасходование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.оплачена)
	               |				И ЗаявкаНаРасходование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	               |				И ЗаявкаНаРасходование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Черновик)
	               |				И ЗаявкаНаРасходование.Проведен) КАК ЗаявкиНаРасходованиеСредствОстатки
	               |ГДЕ
	               |	ЗаявкиНаРасходованиеСредствОстатки.Организация = &Организация";

	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивКлючевыхИмен = Новый Массив;
	МассивКлючевыхИмен.Добавить("IDRequestsForExpenditureOfFunds");
	//МассивКлючевыхИмен.Добавить("IDProject");
	//МассивКлючевыхИмен.Добавить("IDCashFlowStatement");
	//МассивКлючевыхИмен.Добавить("IDDepartment");
	//МассивКлючевыхИмен.Добавить("IDContractor");
	//МассивКлючевыхИмен.Добавить("Amount");
	ВыгрузитьИзмененияТаблицы(РезультатЗапроса, "UnpaidRequestsForExpenditureOfFunds_temp",МассивКлючевыхИмен , , );
	

	//ОчиститьТаблицу("UnpaidRequestsForExpenditureOfFunds");

КонецПроцедуры


Функция ПолучитьТаблицуЗначенийИзСКД(МакетСКД, КомпоновщикНастроек) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки,,,
				Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат;
	
КонецФункции



/////////////////////////////////////////////////// Служебные функции //////////////////////////////////////

#Область СлужебныеФункции
Процедура УстановитьАДОДБКоннект() Экспорт 

	Если НЕ ВыгружатьАДОДБ Тогда
		Возврат;
	КонецЕсли;

	ИмяСервера = "VechirSrvSQL";
	ИмяБазы = "PowerBI_UPR";
	ИмяПользователя = "1C_admin";
	Пароль = "dktihbgbGHF54$!@w";
		
	стрПодключения    = "Provider=SQLOLEDB.1;
	|User ID="+ИмяПользователя+";
	|Pwd="+Пароль+";
	|Data Source=" + ИмяСервера + ";
	|Initial Catalog=" + ИмяБазы + "";
	
	Попытка
		АДОДБКоннект = Новый COMОбъект("ADODB.Connection");
		АДОДБКоннект.Open(стрПодключения);
		
		АДОДБКоманда = Новый COMОбъект("ADODB.Command");
		АДОДБКоманда.ActiveConnection   = АДОДБКоннект;
		
		АДОДБЗапись  = Новый COMОбъект("ADODB.RecordSet");
		
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

Функция ТаблицаСуществует(АДОДБКоннект, ИмяТаблицы)

	Если НЕ ВыгружатьАДОДБ Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;

	CommandText = "select * from dbo.sysobjects where id = object_id(N'[dbo].["+ИмяТаблицы+"]')";
	
	Попытка
		rsRES = NEW COMObject("ADODB.Recordset");
		rsRES.Open(CommandText, АДОДБКоннект);
	Исключение
		АДОДБКоннект.Close();
		
	КонецПопытки;
	
	Если rsRES.eof() Тогда 
		
		Возврат Ложь;
	Иначе
		Возврат Истина;
		
	КонецЕсли;

КонецФункции

Функция ФорматЧислаSQL(ЧислоЗнч)
	Результат = СтрЗаменить(СтрЗаменить(Формат(ЧислоЗнч, "ЧРД=.; ЧН=; ЧГ=0")," ",""),Символы.НПП,"");;	
	Возврат Результат;
КонецФункции

Функция ФорматДатыSQL(ДатаЗнч)
	
	//Если ДатаЗнч = 0 Тогда
	//	ДатаЗнч = Дата('00010101');
	//КонецЕсли;
	Если ДатаЗнч = Дата('00010101') Тогда 
		
		Результат =
		"CONVERT(DateTime,'"
		+ Формат(Дата(1900,01,01), "ДФ = ""dd-MM-yyyy HH:mm:ss""")
		+ "')"
		;
	Иначе
		
		Результат =
		"CONVERT(DateTime,'"
		+ Формат(ДатаЗнч, "ДФ = ""dd-MM-yyyy HH:mm:ss""")
		+ "')"
		;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФорматБулевSQL(БулевоеЗначение)
	Возврат ?(БулевоеЗначение = Истина, "TRUE", "FALSE");
КонецФункции

// + ДДГ 17 фев 2021
//
// эти функции - обёртки над функциями Формат***SQL
// , которые дополнительно добавляют экранирование КАВЫЧКАМИ (что требуется по синтаксису SQL)
//
// прошу обратить внимание, что результат функции ФорматДатыSQL НЕ ДОЛЖЕН экранироваться кавычками
// , поэтому функции СформироватьДатуДляSQL нет

Функция СформироватьСтрокуДляSQL(Значение)
	СтрокаЗначения = Строка(Значение);
	СформированнаяСтрока = "'" + СтрЗаменить(СтрокаЗначения, "'", """") + "'";
	Возврат СформированнаяСтрока;
КонецФункции

Функция СформироватьУникальныйИдентификаторДляSQL(Значение)
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		НовоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
		СформированнаяСтрока = "'" + XMLСтрока(НовоеЗначение) + "'";
	Иначе
		СформированнаяСтрока = "'" + XMLСтрока(Значение) + "'";
	КонецЕсли;
	Возврат СформированнаяСтрока;
КонецФункции

Функция СформироватьЧислоДляSQL(Значение)
	СформированнаяСтрока = "'" + ФорматЧислаSQL(Значение) + "'";
	Возврат СформированнаяСтрока;
КонецФункции

Функция СформироватьБулевДляSQL(Знач Значение)
	Значение = (Значение = Истина);
	СформированнаяСтрока = "'" + ФорматБулевSQL(Значение) + "'";
	Возврат СформированнаяСтрока;
КонецФункции
// - ДДГ 17 фев 2021

// + ДДГ 27 янв 2022
// обнов 25 апр 2022
Функция ПолучитьСоотвИменТиповПолейДаты()

	СоотвПолейДаты = Новый Соответствие;

	СоотвПолейДаты.Вставить("date",		"DATE");
	СоотвПолейДаты.Вставить("time",		"TIME");
	СоотвПолейДаты.Вставить("day",		"INT");
	СоотвПолейДаты.Вставить("month",	"INT");
	СоотвПолейДаты.Вставить("year",		"INT");

	Возврат СоотвПолейДаты;

КонецФункции

Процедура ОчиститьЗначенияМассиваПолейSQL(МассивПолей)

	Для Каждого СтруктураПоля Из МассивПолей Цикл

		ПустоеЗначение = Неопределено;

		ТипПоля = СтруктураПоля.Тип;

		Если ТипПоля = "BIT" Тогда
			ПустоеЗначение = Ложь;
		ИначеЕсли ТипПоля = "DATE" ИЛИ ТипПоля = "DATETIME" ИЛИ ТипПоля = "TIME" Тогда
			ПустоеЗначение = Дата(1,1,1);
		ИначеЕсли ТипПоля = "INT" ИЛИ ТипПоля = "FLOAT" Тогда
			ПустоеЗначение = 0;
		ИначеЕсли ТипПоля = "TEXT" ИЛИ ЛЕВ(ТипПоля, 7) = "varchar" Тогда
			ПустоеЗначение = "";
		КонецЕсли;

		СтруктураПоля.Значение = ПустоеЗначение;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТипПоляПоОписаниюТиповДляSQL(ОписаниеТиповПоля,ИмяПоля)

	Если ОписаниеТиповПоля.СодержитТип(Тип("Булево")) Тогда
		ТипПоля = "BIT";
	ИначеЕсли ОписаниеТиповПоля.СодержитТип(Тип("Дата")) Тогда

		СвойстваДаты = ОписаниеТиповПоля.КвалификаторыДаты.ЧастиДаты;

		Если СвойстваДаты = ЧастиДаты.Дата Тогда
			ТипПоля = "DATE";
		ИначеЕсли СвойстваДаты = ЧастиДаты.Время Тогда
			ТипПоля = "TIME";
		Иначе
			ТипПоля = "DATETIME";
		КонецЕсли;

	ИначеЕсли ОписаниеТиповПоля.СодержитТип(Тип("Число")) Тогда
		ТипПоля = ?(ОписаниеТиповПоля.КвалификаторыЧисла.РазрядностьДробнойЧасти > 0, "FLOAT", "FLOAT");
	ИначеЕсли ОписаниеТиповПоля.СодержитТип(Тип("Строка"))  Тогда
		ДлинаСтроки = ОписаниеТиповПоля.КвалификаторыСтроки.Длина;
		ТипПоля = ?(ДлинаСтроки < 1, "TEXT", "varchar(" + Формат(ДлинаСтроки, "ЧГ=0") + ")");
	Иначе
		ТипПоля = "uniqueidentifier";
	КонецЕсли;

	Если Найти(ИмяПоля, "ID") > 0 Тогда
		ТипПоля = "uniqueidentifier";	
	КонецЕсли;
	
	Возврат ТипПоля;

КонецФункции

Функция ПолучитьСтруктуруСвойстваПоляSQL(ИмяПоля, ТипПоля, ПорядокПоля = 0, ЗначениеПоля = "", Ограничение = "", БезЗаменыNULL = Ложь)

	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Имя",			ИмяПоля);
	СтруктураСвойств.Вставить("Тип",			ТипПоля);
	СтруктураСвойств.Вставить("Значение",		ЗначениеПоля);
	СтруктураСвойств.Вставить("Ограничение",	Ограничение);
	СтруктураСвойств.Вставить("Порядок",		ПорядокПоля);
	СтруктураСвойств.Вставить("БезЗаменыNULL",	БезЗаменыNULL);

	Возврат СтруктураСвойств;

КонецФункции

Функция СформироватьПроизвольноеЗначениеSQL(СтруктураПоля)

	ТипПоля		= СтруктураПоля.Тип;
	СтрокаПоля	= СтруктураПоля.Значение;
	БезЗаменыNULL	= СтруктураПоля.БезЗаменыNULL;

	Если БезЗаменыNULL И (
			СтруктураПоля.Значение = null
		ИЛИ СтруктураПоля.Значение = Неопределено
	) Тогда
		СтрокаПоля = "null";
		Возврат СтрокаПоля;
	КонецЕсли;

	Если ТипПоля = "BIT" Тогда
		СтрокаПоля = СформироватьБулевДляSQL(СтрокаПоля);
	ИначеЕсли ТипПоля = "DATE" ИЛИ ТипПоля = "DATETIME" ИЛИ ТипПоля = "TIME" Тогда
		СтрокаПоля = ФорматДатыSQL(СтрокаПоля);
	ИначеЕсли ТипПоля = "INT" ИЛИ ТипПоля = "FLOAT" Тогда
		СтрокаПоля = СформироватьЧислоДляSQL(СтрокаПоля);
	ИначеЕсли ТипПоля = "TEXT" ИЛИ ЛЕВ(ТипПоля, 7) = "varchar" Тогда
		СтрокаПоля = СформироватьСтрокуДляSQL(СтрокаПоля);
	ИначеЕсли ТипПоля = "uniqueidentifier" Тогда
		СтрокаПоля = СформироватьУникальныйИдентификаторДляSQL(СтрокаПоля);
	КонецЕсли;

	Возврат СтрокаПоля;

КонецФункции

Функция ПолучитьМассивПолейИзКолонокТаблицы(
	КолонкиТаблицы
	, МассивКлючевыхИмен = Неопределено
	, Ограничение = ""
	, СоотвПереопределяемыхПолей = Неопределено
	, МассивПоляБезЗаменыNULL = Неопределено
)

	ЗаданоОграничение = НЕ ПустаяСтрока(Ограничение);

	СоотвПереопределяемыхПолей = ?(СоотвПереопределяемыхПолей = Неопределено, Новый Соответствие, СоотвПереопределяемыхПолей);
	СоотвПереопределяемыхПолей.Вставить("СнятиеРегистрации",	"НЕНУЖНО");
	СоотвПереопределяемыхПолей.Вставить("УдалениеОбъекта",		"НЕНУЖНО");

	МассивКлючевыхИмен = ?(МассивКлючевыхИмен = Неопределено, Новый Массив, МассивКлючевыхИмен);
	СоотвКлючевыхПолей = Новый Соответствие;

	Для Каждого КлючевоеИмя Из МассивКлючевыхИмен Цикл
		СоотвКлючевыхПолей.Вставить(КлючевоеИмя, Истина);
	КонецЦикла;

	МассивПоляБезЗаменыNULL = ?(МассивПоляБезЗаменыNULL = Неопределено, Новый Соответствие, МассивПоляБезЗаменыNULL);
	СоотвПоляБезЗаменыNULL = Новый Соответствие;

	Для Каждого ПолеБезЗамены Из МассивПоляБезЗаменыNULL Цикл
		СоотвПоляБезЗаменыNULL.Вставить(ПолеБезЗамены, Истина);
	КонецЦикла;

	МассивПолей = Новый Массив;

	Для Каждого КолонкаТаблицы Из КолонкиТаблицы Цикл

		ИмяПоля	= КолонкаТаблицы.Имя;

		ПереопределениеПоля = СоотвПереопределяемыхПолей.Получить(ИмяПоля);

		Если ПереопределениеПоля = Неопределено Тогда
			ТипПоля	= ПолучитьТипПоляПоОписаниюТиповДляSQL(КолонкаТаблицы.ТипЗначения,ИмяПоля);
		ИначеЕсли ПереопределениеПоля = "НЕНУЖНО" Тогда
			Продолжить;
		Иначе
			ТипПоля	= ПереопределениеПоля;
		КонецЕсли;

		БезЗаменыNULL = (СоотвПоляБезЗаменыNULL.Получить(ИмяПоля) = Истина);

		ЭтоКлючевоеПоле = (СоотвКлючевыхПолей.Получить(ИмяПоля) = Истина);

		ОграничениеПоля = ?(ЗаданоОграничение И ЭтоКлючевоеПоле, Ограничение, "");

		СтруктураСвойства = ПолучитьСтруктуруСвойстваПоляSQL(ИмяПоля, ТипПоля, , , ОграничениеПоля, БезЗаменыNULL);
		МассивПолей.Добавить(СтруктураСвойства);

	КонецЦикла;

	Возврат МассивПолей;

КонецФункции

Функция СформироватьКомбинированноеОграничение(НаименованиеОграничения, МассивКлючевыхИмен)

	СтрокиПолей = "";

	Для Каждого ИмяПоля Из МассивКлючевыхИмен Цикл

		СтрокаПоля	= " " + ИмяПоля + " ASC,";

		СтрокиПолей = СтрокиПолей + СтрокаПоля;

	КонецЦикла;

	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокиПолей, 1);

	СтрокаОграничения = " , CONSTRAINT [" + НаименованиеОграничения + "] PRIMARY KEY CLUSTERED(" + СтрокиПолей +")";

	Возврат СтрокаОграничения;

КонецФункции

Функция ПолучитьТекстУсловия(МассивКлючевыхПолей)

	ПоляУсловия = "";

	Для Каждого СтруктураПоля Из МассивКлючевыхПолей Цикл

		ИмяПоля		= СтруктураПоля.Имя;
		СтрокаПоля	= СформироватьПроизвольноеЗначениеSQL(СтруктураПоля);

		СтрокаУсловия
			= Символы.ПС  + Символы.Таб + ИмяПоля
			+ Символы.Таб + " = " + СтрокаПоля + " AND"
		;

		ПоляУсловия = ПоляУсловия + СтрокаУсловия;

	КонецЦикла;

	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПоляУсловия, 3);

	ТекстУсловия = " WHERE (" + ПоляУсловия + Символы.ПС + ")";

	Возврат ТекстУсловия;

КонецФункции

Функция ПолучитьТекстЗапросаCreateTable(НаименованиеТаблицы, ТекстОграничения = "", МассивПолей)

	ТекстСозданиеТаблицы = "CREATE TABLE " + НаименованиеТаблицы + "(";

	ПоляCreate	= "";

	Для Каждого СтруктураПоля Из МассивПолей Цикл

		СтрокаЗапроса
			= Символы.ПС + СтруктураПоля.Имя + Символы.Таб + СтруктураПоля.Тип
			+ ?(ПустаяСтрока(СтруктураПоля.Ограничение), "", Символы.Таб)
			+ СтруктураПоля.Ограничение + ","
		;

		ПоляCreate = ПоляCreate + СтрокаЗапроса;

	КонецЦикла;

	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПоляCreate, 1);

	ТекстСозданиеТаблицы = ТекстСозданиеТаблицы + ПоляCreate + "
		|" + ТекстОграничения + "
		|)";

	Возврат ТекстСозданиеТаблицы;

КонецФункции

Функция ПолучитьТекстЗапросаInsertUpdate(НаименованиеТаблицы, ТекстУсловия, МассивПолей)

	ПоляUpdate	= "";
	ПоляInsert	= "";

	Для Каждого СтруктураПоля Из МассивПолей Цикл

		ИмяПоля		= СтруктураПоля.Имя;
		ТипПоля		= СтруктураПоля.Тип;
		СтрокаПоля	= СформироватьПроизвольноеЗначениеSQL(СтруктураПоля);

		СтрокаПоля = Строка(СтрокаПоля) + ",";

		СтрокаПоляInsert = Символы.ПС + СтрокаПоля;
		СтрокаПоляUpdate = Символы.ПС + ИмяПоля + Символы.Таб + " = " + СтрокаПоля;

		ПоляInsert = ПоляInsert + СтрокаПоляInsert;
		ПоляUpdate = ПоляUpdate + СтрокаПоляUpdate;

	КонецЦикла;

	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПоляInsert, 1);
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПоляUpdate, 1);

	ТекстЗапроса =
		"IF(EXISTS
		|(SELECT * FROM " + НаименованиеТаблицы + "
		|" + ТекстУсловия + "
		|))
		|BEGIN
		|UPDATE " + НаименованиеТаблицы + "
		|SET " + ПоляUpdate + " 
		|" + ТекстУсловия + "
		|END
		|ELSE
		|BEGIN
		|INSERT INTO " + НаименованиеТаблицы + "
		|VALUES(" + ПоляInsert + "
		|)
		|END";

	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаDelete(НаименованиеТаблицы, ТекстУсловия)

	ТекстЗапроса =
		"DELETE FROM " + НаименованиеТаблицы + "
		|" + ТекстУсловия
	;

	Возврат ТекстЗапроса;

КонецФункции
// - ДДГ 27 янв 2022

//// + ДДГ 31 янв 2022
//// обнов 25 апр 2022
Процедура ВыгрузитьИзмененияТаблицы(
	  РезультатЗапроса
	, НаименованиеТаблицы
	, МассивКлючевыхИмен
	, СоотвПереопределяемыхПолей	= Неопределено
	, МассивСнятияРегистрации		= Неопределено
	, МассивКлючевыхДляУдаления		= Неопределено
	, МассивПоляБезЗаменыNULL		= Неопределено
)

	Если НЕ РезультатЗапроса.Количество() Тогда
		Возврат;
	КонецЕсли;

	ВсегоКлючевыхПолей = МассивКлючевыхИмен.Количество();

	Если ВсегоКлючевыхПолей < 1 Тогда
		Возврат;
	ИначеЕсли ВсегоКлючевыхПолей = 1 Тогда
		НаименованиеОграничения	= "ID_" + НаименованиеТаблицы;
		ТекстОграничения		= "";
		Ограничение				= " CONSTRAINT " + НаименованиеОграничения + " PRIMARY KEY";
	Иначе
		НаименованиеОграничения	= "PK_" + НаименованиеТаблицы;
		ТекстОграничения		= СформироватьКомбинированноеОграничение(НаименованиеОграничения, МассивКлючевыхИмен);
		Ограничение				= "";
	КонецЕсли;

	//

	КолонкиТаблицы = РезультатЗапроса.Колонки;

	МассивПолей	= ПолучитьМассивПолейИзКолонокТаблицы(
		  КолонкиТаблицы
		, МассивКлючевыхИмен
		, Ограничение
		, СоотвПереопределяемыхПолей
		, МассивПоляБезЗаменыNULL
	);
	СоотвПолей	= Новый Соответствие;

	Для Каждого СтруктураПоля Из МассивПолей Цикл
		СоотвПолей.Вставить(СтруктураПоля.Имя, СтруктураПоля);
	КонецЦикла;

	//

	УстановитьАДОДБКоннект();

	Если НЕ ТаблицаСуществует(АДОДБКоннект, НаименованиеТаблицы) Тогда

		ТекстСозданиеТаблицы = ПолучитьТекстЗапросаCreateTable(НаименованиеТаблицы, ТекстОграничения, МассивПолей);

		Если ВыгружатьАДОДБ Тогда
			АДОДБКоннект.Execute(ТекстСозданиеТаблицы);
		КонецЕсли;

	КонецЕсли;

	//

	МассивКлючевыхПолей = Новый Массив;

	Для Каждого ИмяПоля Из МассивКлючевыхИмен Цикл
		СтруктураПоля	= СоотвПолей.Получить(ИмяПоля);
		МассивКлючевыхПолей.Добавить(СтруктураПоля);
	КонецЦикла;

	МассивПолейУдаления = ?(МассивКлючевыхДляУдаления = Неопределено, МассивКлючевыхПолей, Новый Массив);

	Если МассивКлючевыхДляУдаления <> Неопределено Тогда
		Для Каждого ИмяПоля Из МассивКлючевыхДляУдаления Цикл
			СтруктураПоля	= СоотвПолей.Получить(ИмяПоля);
			МассивПолейУдаления.Добавить(СтруктураПоля);
		КонецЦикла;
	КонецЕсли;

	//

	СниматьРегистрацию = (ТипЗнч(МассивСнятияРегистрации) = Тип("Массив"));

	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл

		ОчиститьЗначенияМассиваПолейSQL(МассивПолей);

		Для Каждого Колонка Из КолонкиТаблицы Цикл

			ИмяКолонки		= Колонка.Имя;
			СтруктураПоля	= СоотвПолей.Получить(ИмяКолонки);

			Если СтруктураПоля = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			СтруктураПоля.Значение = СтрокаРезультата[ИмяКолонки];

		КонецЦикла;

		//Если СтрокаРезультата.УдалениеОбъекта Тогда 
		//	ТекстУсловия = ПолучитьТекстУсловия(МассивПолейУдаления);
		//	ТекстЗапроса = ПолучитьТекстЗапросаDelete(НаименованиеТаблицы, ТекстУсловия);
		//Иначе
			ТекстУсловия = ПолучитьТекстУсловия(МассивКлючевыхПолей);
			ТекстЗапроса = ПолучитьТекстЗапросаInsertUpdate(НаименованиеТаблицы, ТекстУсловия, МассивПолей);
		//КонецЕсли;
		
		Попытка 
			Если ВыгружатьАДОДБ Тогда
				АДОДБКоннект.Execute(ТекстЗапроса);
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("ВыгрузкаВPowerBI",УровеньЖурналаРегистрации.Ошибка,,ТекстЗапроса,ТекстЗапроса);
		КонецПопытки;
		Если СниматьРегистрацию Тогда
			МассивСнятияРегистрации.Добавить(СтрокаРезультата.СнятиеРегистрации);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
// - ДДГ 31 янв 2022

//// + ДДГ 28 янв 2022
Процедура СнятьРегистрациюОбъектовСсылочногоТипа(МассивСнятияРегистрации)

	Для Каждого СсылкаДляОбработки Из МассивСнятияРегистрации Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаСPowerBI, СсылкаДляОбработки);
	КонецЦикла;

	МассивСнятияРегистрации = Новый Массив;

КонецПроцедуры

Процедура СнятьРегистрациюРегистра(МенеджерРегистра, МассивСнятияРегистрации)

	Для Каждого СтруктураОтбора Из МассивСнятияРегистрации Цикл

		//НаборЗаписей = МенеджерРегистра.СоздатьНаборЗаписей();

		//Для Каждого КлючЗначение Из СтруктураОтбора Цикл
		//	НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		//КонецЦикла;

		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаСPowerBI, СтруктураОтбора.Регистратор);

	КонецЦикла;

	МассивСнятияРегистрации = Новый Массив;

КонецПроцедуры

Процедура ОчиститьТаблицу(НаименованиеТаблицы)
	
	УстановитьАДОДБКоннект();
	
	Если ТаблицаСуществует(АДОДБКоннект, НаименованиеТаблицы) Тогда
		
		ТекстОчистки =   "TRUNCATE TABLE "+НаименованиеТаблицы; 
		
		
		Если ВыгружатьАДОДБ Тогда
			АДОДБКоннект.Execute(ТекстОчистки);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
//// - ДДГ 28 янв 2022
#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////////////////////////////
УзелОбменаСPowerBI = Константы.ПланОбменаPowerBI.Получить();

ВыгружатьАДОДБ = Истина;
